---
kind: method
id: M:Autodesk.Revit.DB.Form.CanManipulateProfile(System.Int32)
zh: 对话框、窗口、窗体
source: html/e45f9bf7-cf84-cb97-dde2-56c7a72d28a1.htm
---
# Autodesk.Revit.DB.Form.CanManipulateProfile Method

**中文**: 对话框、窗口、窗体

Tell if a profile can be deleted/moved/rotated.

## Syntax (C#)
```csharp
public bool CanManipulateProfile(
	int profileIndex
)
```

## Parameters
- **profileIndex** (`System.Int32`) - Index to specify the profile.